In [76]:
 import numpy as np

In [77]:
a = np.array([[1, 6],
              [2, 8],
              [3, 11],
              [3, 10],
              [1, 7]])

In [78]:
mean_a = a.mean(axis = 0)
mean_a

array([2. , 8.4])

**Задание 2**

In [79]:
a_centered = a - mean_a
a_centered

array([[-1. , -2.4],
       [ 0. , -0.4],
       [ 1. ,  2.6],
       [ 1. ,  1.6],
       [-1. , -1.4]])

**Задание 3**

In [80]:
x1 = np.array([-1, 0, 1, 1, -1])
x2 = np.array([-2.4, -0.4, 2.6, 1.6, -1.4])

In [81]:
a_centered_sp = x1 @ x2
a_centered_sp

8.0

In [82]:
N = 5
8 / (N-1)

2.0

***Задания по теме "Работа с данными в Pandas"***

**Задание 1**

In [83]:
import pandas as pd

In [84]:
authors = pd.DataFrame({'author_id':[1, 2, 3],
'author_name':['Тургенев', 'Чехов', 'Островсикй',]}, columns=['author_id', 'author_name'])

In [85]:
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островсикй

In [86]:
book = pd.DataFrame({'author_id':[1, 1, 1, 2, 2, 3, 3],
'book_title':['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклинники'], 
  'price':[450, 300, 350, 500, 450, 370, 290]})

In [87]:
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклинники    290

**Задание 2**

In [88]:
authors_price = pd.merge(authors, book, on = 'author_id', how = 'inner')
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островсикй                 Гроза    370
6          3  Островсикй  Таланты и поклинники    290

**Задание 3**

In [89]:
top5 = authors_price.nlargest(5, 'price')

In [90]:
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островсикй              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

**Задание 4**

In [91]:
min_price = authors_price.groupby('author_name')['price'].min()
min_price

author_name
Островсикй    290
Тургенев      300
Чехов         450
Name: price, dtype: int64

In [92]:
max_price = authors_price.groupby('author_name')['price'].max()
max_price

author_name
Островсикй    370
Тургенев      450
Чехов         500
Name: price, dtype: int64

In [93]:
mean_price = authors_price.groupby('author_name')['price'].mean()
mean_price

author_name
Островсикй    330.000000
Тургенев      366.666667
Чехов         475.000000
Name: price, dtype: float64

In [94]:
author_name = authors_price.groupby('author_name')
author_name

In [95]:
authors_stat = pd.concat([min_price, max_price, mean_price], axis = 1)
authors_stat

             price  price       price
author_name
Островсикй     290    370  330.000000
Тургенев       300    450  366.666667
Чехов          450    500  475.000000

2-й способ

In [106]:
min_price = authors_price.groupby('author_name').agg({'price':'min'})
min_price = min_price.rename(columns={'price':'min_price'})
min_price

             min_price
author_name
Островсикй         290
Тургенев           300
Чехов              450

In [104]:
max_price = authors_price.groupby('author_name').agg({'price':'max'})
max_price = max_price.rename(columns={'price':'max_price'})
max_price

             max_price
author_name
Островсикй         370
Тургенев           450
Чехов              500

In [107]:
mean_price = authors_price.groupby('author_name').agg({'price':'mean'})
mean_price = mean_price.rename(columns={'price':'mean_price'})
mean_price

             mean_price
author_name
Островсикй   330.000000
Тургенев     366.666667
Чехов        475.000000

In [108]:
authors_stat = pd.concat([min_price, max_price, mean_price], axis = 1)
authors_stat

             min_price  max_price  mean_price
author_name
Островсикй         290        370  330.000000
Тургенев           300        450  366.666667
Чехов              450        500  475.000000